GuoCaiXu/Learn/Keil5/STM32F103RC/27.通用定时器-四路PWM信号输出/User/generamtim/bsp_generamtim.h
# ifndef _BSP_GENERAMTIM_H
# define _BSP_GENERAMTIM_H

# include "stm32f10x.h"

/*********通用定时器TIM参数定义，只限TIM2, 3, 4, 5*********/
/*当使用不同定时器的时候，对应的GPIO是不一样的, 这点要注意*/
/*我们这里默认使用TIM3*/


# define GENERAL_TIM                    TIM3
# define GENERAL_TIM_APBxClock_FUN      RCC_APB1PeriphClockCmd
# define GENERAL_TIM_CLK                RCC_APB1Periph_TIM3
/*输出PWM频率为 72M     (ARR+1)*(PSC+1)*/
# define GENERAL_TIM_Period             (10-1)
# define GENERAL_TIM_Prescaler          (72-1)

/*占空比配置*/
# define GENERAL_TIM_CCR1               5
# define GENERAL_TIM_CCR2               4
# define GENERAL_TIM_CCR3               3
# define GENERAL_TIM_CCR4               2

/*TIM3 输出比较通道1*/
# define GENERAL_TIM_CH1_GPIO_CLK       RCC_APB2Periph_GPIOA
# define GENERAL_TIM_CH1_PORT           GPIOA
# define GENERAL_TIM_CH1_PIN            GPIO_Pin_6

/*TIM3 输出比较通道2*/
# define GENERAL_TIM_CH2_GPIO_CLK       RCC_APB2Periph_GPIOA
# define GENERAL_TIM_CH2_PORT           GPIOA
# define GENERAL_TIM_CH2_PIN            GPIO_Pin_7

/*TIM3 输出比较通道3*/
# define GENERAL_TIM_CH3_GPIO_CLK       RCC_APB2Periph_GPIOB
# define GENERAL_TIM_CH3_PORT           GPIOB
# define GENERAL_TIM_CH3_PIN            GPIO_Pin_0

/*TIM3 输出比较通道4*/
# define GENERAL_TIM_CH4_GPIO_CLK       RCC_APB2Periph_GPIOB
# define GENERAL_TIM_CH4_PORT           GPIOB
# define GENERAL_TIM_CH4_PIN            GPIO_Pin_1

/***********函数定义***********/
void GENERAL_TIM_Init(void);

# endif /*_BSP_GENERAMTIM_H*/
